import { Component, OnInit } from '@angular/core';
import { ModalController } from '@ionic/angular';
import { Know2Page } from '../know2/know2.page';

@Component({
  selector: 'app-know',
  templateUrl: './know.page.html',
  styleUrls: ['./know.page.scss'],
})
export class KnowPage implements OnInit {

  Know: any = [
    {
      name: "อาการของโรคซึมเศร้า",
      img: "https://www.techhub.in.th/wp-content/uploads/2021/05/118283916_b19c5a1f-162b-410b-8169-f58f0d153752.jpg",
      detail: "โรคซึมเศร้า เป็นโรคทางจิตเวชที่มีผู้เป็นจำนวนไม่น้อย แต่ยังมีผู้รู้จักโรคนี้ไม่มากนัก บางคนเป็นโดยที่ตัวเองไม่ทราบ คิดว่าเป็นเพราะตนเองคิดมากไปเองก็มี ทำให้ไม่ได้รับการรักษาที่เหมาะสม และทันท่วงทีผมเขียนหนังสือเล่มนี้ด้วยหวังว่าจะช่วยให้ผู้อ่านเข้าใจโรคนี้มากขึ้น เพราะพบว่าหลายๆ คนสงสัยว่าตัวเองจะเป็นโรคนี้หรือเปล่า บ้างก็รักษามาบ้างแล้วและอยากจะรู้เกี่ยวกับโรคที่ตัวเองเป็นมากขึ้น แต่ก็ไม่รู้จะหากข้อมูลจากไหน จะถามแพทย์ก็เกรงใจ เนื้อหาที่เขียนส่วนหนึ่งได้มาจากคำถามหรือข้อสงสัยที่ผู้ป่วยมักถามผม คิดว่าคนอื่นๆ ก็น่าจะมีข้อสงสัยคล้ายๆ กัน เชื่อว่าหนังสือนี้คงคลายข้อสงสัยของท่านได้ระดับหนึ่ง",
    },
    {
      name: "การรักษาโรคซึมเศร้า",
      img: "",
      detail: "โรคซึมเศร้านี้หากได้รับการรักษา ผู้ที่เป็นจะอาการดีขึ้นมาก อาการซึมเศร้าร้องไห้บ่อยๆ หรือรู้สึกท้อแท้หมดกำลังใจ จะกลับมาดีขึ้นจนผู้ที่เป็นบางคนบอกว่าไม่เข้าใจว่าตอนนั้นทำไมจึงรู้สึก เศร้าไปได้ถึงขนาดนั้น ยิ่งหากมารับการรักษาเร็วเท่าไรก็ยิ่งจะอาการดีขึ้นเร็วเท่านั้น ยิ่งป่วยมานานก็ยิ่งจะรักษายากการรักษาที่สำคัญในโรคนี้คือการรักษาด้วยยา แก้เศร้าโดยเฉพาะในรายที่อาการมาก ส่วนในรายที่มีอาการไม่มาก แพทย์อาจรักษาด้วยการช่วยเหลือชี้แนะการมองปัญหาต่างๆ ในมุมมองใหม่ แนวทางในการปรับตัว หรือการหาสิ่งที่ช่วยทำให้จิตใจผ่อนคลายความทุกข์ใจลง ร่วมกับการให้ยาแก้เศร้าหรือยาคลายกังวลเสริมในช่วงที่เห็นว่าจำเป็น"
    },
    {
      name: "แนวทางการเฝ้าระวังกรณีรุนแรง",
      img: "",
      detail: "",
    },
    {
      name: "การอยู่ร่วมกันกับผู้ป่วย",
      img: "",
      detail: "",
    },

  ]

  async presentModal(choice: any) {
    const model = await this.KnowController.create({
      component: Know2Page,
      componentProps: {
        name: choice.name,
        img: choice.img,
        detail: choice.detail,
      }
    })
    return await model.present();

  }

  constructor(private KnowController: ModalController) { }

  ngOnInit()  {

  }

}
