import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-from',
  templateUrl: './from.page.html',
  styleUrls: ['./from.page.scss'],
})
export class FromPage implements OnInit {

  /*TP:any=[{title:'อาการเบื่อ'},]
  public form = [
    { val: 0,tp: '0: ไม่เลย' ,isChecked: false },
    { val: 1,tp: '1: มีบางวันหรือไม่บ่อย' ,isChecked: false },
    { val: 2,tp: '2: มีค่อนข้างบ่อย' ,isChecked: false },
    { val: 3,tp: '3: มีเกือบทุกวัน' ,isChecked: false }
  ];

  Q: any=[{tl2:'คำถามที่1: ท่านมีพฤติกรรมการกินที่มากเกินไปหรือว่าน้อยเกินไปหรือไม่'},
          {tl2:'คำถามที่2: ท่านมีอาการหลับๆตื่นๆ หลับยากหรือไม่'},
          {tl2:'คำถามที่3: '},
          {tl2:'คำถามที่4: '},
          {tl2:'คำถามที่5: '},
          {tl2:'คำถามที่6: '},
          {tl2:'คำถามที่7: '},
          {tl2:'คำถามที่8: '},
          {tl2:'คำถามที่9: '}]

  constructor() { }

  ngOnInit() {
  }*/

  q1: string
  q2: string
  q3: string
  q4: string
  q5: string
  q6: string
  q7: string
  q8: string
  q9: string
  TP:any=[{title:'อาการเบื่อ'},]
  public form = [
    { val: 0,tp: '0: ไม่เลย' ,isChecked: false },
    { val: 1,tp: '1: มีบางวันหรือไม่บ่อย' ,isChecked: false },
    { val: 2,tp: '2: มีค่อนข้างบ่อย' ,isChecked: false },
    { val: 3,tp: '3: มีเกือบทุกวัน' ,isChecked: false }
  ];

  Q: any=[{tl2:'คำถามที่1: เบื่อ ทำอะไร ๆ ก็ไม่เพลิดเพลิน'},
          {tl2:'คำถามที่2: ไม่สบายใจ ซึมเศร้า หรือท้อแท้'},
          {tl2:'คำถามที่3: หลับยาก หรือหลับ ๆ ตื่น ๆ หรือหลับมากไป'},
          {tl2:'คำถามที่4: เหนื่อยง่าย หรือไม่ค่อยมีแรง'},
          {tl2:'คำถามที่5: เบื่ออาหาร หรือกินมากเกินไป'},
          {tl2:'คำถามที่6: รู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลว หรือเป็นคนทำให้ตัวเอง หรือครอบครัวผิดหวัง'},
          {tl2:'คำถามที่7: สมาธิไม่ดีเวลาทำอะไร เช่น ดูโทรทัศน์ ฟังวิทยุ หรือทำงานท่ีต้องใช้ความตั้งใจ'},
          {tl2:'คำถามที่8: พูดหรือทำอะไรช้าจนคนอื่นมองเห็น หรือกระสับกระส่ายจนท่านอยู่ไม่นิ่งเหมือนเคย'},
          {tl2:'คำถามที่9: คิดทำร้ายตนเอง หรือคิดว่าถ้าตาย ๆ ไปเสียคงจะดี'}]




  result:Number;
  addResult(q1:string,q2:string,q3:string,q4:string,q5:string,q6:string,q7:string,q8:string,q9:string){
    this.result = parseInt(this.q1)+parseInt(this.q2)+parseInt(this.q3)+parseInt(this.q4)+parseInt(this.q5)+parseInt(this.q6)+parseInt(this.q7)+parseInt(this.q8)+parseInt(this.q9);
    if(this.result >= 20){
      alert('ท่านมีอาการซึมเศร้าระดับรุนแรง : ควรเข้ารับคำแนะนำจากเเพทย์เพื่อประเมินอาการเพิ่มเติม')
    }
    if(this.result <= 19){
      alert('ท่านมีอาการซึมเศร้าระดับรุนแรงค่อนข้างมาก : ควรพบแพทย์เพื่อประเมินอาการและให้การรักษา ระหว่างนี้ควรพักผ่อนให้เพียงพอ นอนหลับให้ได้ 6-8 ชั่วโมง ออกกำลังกายเบาๆ ทำกิจกรรมที่ทำให้ผ่อนคลาย ไม่เก็บตัว และควรขอคำปรึกษาช่วยเหลือจากผู้ใกล้ชิด')
    }
    if(this.result <= 14){
      alert('ท่านมีอาการซึมเศร้าระดับปานกลาง : ควรพักผ่อนให้เพียงพอ นอนหลับให้ได้ 6-8 ชั่วโมง ออกกำลังกายสม่ำเสมอ ทำกิจกรรมที่ทำให้ผ่อนคลาย พบปะเพื่อนฝูง ควรขอคำปรึกษาช่วยเหลือจากผู้ที่ไว้วางใจ ไม่จมอยู่กับปัญหา มองหาหนทางคลี่คลาย หากอาการที่ท่านเป็นมีผลกระทบต่อการทำงานหรือการเข้าสังคม (อาการซึมเศร้าทำให้ท่านมีปัญหาในการทำงาน การดูแลสิ่งต่าง ๆ ในบ้าน หรือการเข้ากับผู้คน ในระดับมากถึงมากที่สุด) หรือหากท่านมีอาการระดับนี้มานาน 1-2 สัปดาห์แล้วยังไม่ดีขึ้น ควรพบแพทย์เพื่อรับการช่วยเหลือรักษา')
    }
    if(this.result <= 8){
      alert('ท่านมีอาการซึมเศร้าระดับเล็กน้อย : ควรพักผ่อนให้เพียงพอ นอนหลับให้ได้ 6-8 ชั่วโมง ออกกำลังกายสม่ำเสมอ ทำกิจกรรมที่ทำให้ผ่อนคลาย พบปะเพื่อนฝูง ควรทำแบบประเมินอีกครั้งใน 1 สัปดาห์')
    }
    if(this.result <= 4){
      alert('ท่านไม่มีอาการซึมเศร้าหรือมีก็เพียงเล็กน้อย : ไม่จำเป็นต้องรักษา')
    }
  }
  ngOnInit() {
  }

}



